nxp-appcodehub/dm-wifi-cli-frdm-mcxn947/sdmmc/src/fsl_sdio.c
    uint8_t temp        = 0U;
    uint32_t retryTimes = SDIO_RETRY_TIMES;
    status_t status     = kStatus_SDMMC_SDIO_SwitchHighSpeedFail;
    status_t error      = kStatus_Success;

    if ((card->cccrflags & SDIO_CCCR_SUPPORT_HIGHSPEED) != 0U)
    {
        error = SDIO_IO_Access_Direct(card, kSDIO_IORead, kSDIO_FunctionNum0, kSDIO_RegBusSpeed, 0U, &temp, false);
        if (kStatus_Success != error)
        {
            return kStatus_SDMMC_TransferFailed;
        }

        do
        {
            temp &= (uint8_t)~SDIO_CCCR_BUS_SPEED_MASK;
            temp |= SDIO_CCCR_ENABLE_HIGHSPEED_MODE;

            retryTimes--;
            /* enable high speed mode */
            error =
                SDIO_IO_Access_Direct(card, kSDIO_IOWrite, kSDIO_FunctionNum0, kSDIO_RegBusSpeed, temp, &temp, true);
            if (kStatus_Success != error)
            {
                continue;
            }
            /* either EHS=0 and SHS=0 ,the card is still in default mode  */
            if ((temp & 0x03U) == 0x03U)
            {
                card->busClock_Hz = SDMMCHOST_SetCardClock(
                    card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_50MHZ));
                status = kStatus_Success;
                break;
            }
            else
            {
                continue;
            }

        } while (retryTimes != 0U);
    }
    else
    {
        /* default mode 25MHZ */
        card->busClock_Hz =
            SDMMCHOST_SetCardClock(card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_25MHZ));
        status = kStatus_Success;
    }

    return status;
}

static status_t SDIO_SelectBusTiming(sdio_card_t *card)
{
    assert(card != NULL);

    uint32_t targetBusFreq   = SD_CLOCK_25MHZ;
    uint32_t targetTiming    = 0U;
    uint8_t temp             = 0U;
    uint32_t supportModeFlag = 0U;
    uint32_t retryTimes      = SDIO_RETRY_TIMES;
    status_t error           = kStatus_Success;

    do
    {
        if (card->currentTiming == kSD_TimingSDR12DefaultMode)
        {
            /* if timing not specified, probe card capability from SDR104 mode */
            card->currentTiming = kSD_TimingSDR104Mode;
        }

        if (card->currentTiming == kSD_TimingSDR104Mode)
        {
            if (((card->host->capability & (uint32_t)kSDMMCHOST_SupportSDR104) != 0U) &&
                ((card->cccrflags & SDIO_CCCR_SUPPORT_SDR104) == SDIO_CCCR_SUPPORT_SDR104) &&
                (card->operationVoltage == kSDMMC_OperationVoltage180V))
            {
                targetTiming    = SDIO_CCCR_ENABLE_SDR104_MODE;
                targetBusFreq   = FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_208MHZ);
                supportModeFlag = SDIO_CCCR_SUPPORT_SDR104;
            }
            else
            {
                card->currentTiming = kSD_TimingDDR50Mode;
            }
        }

        if (card->currentTiming == kSD_TimingDDR50Mode)
        {
            if (((card->host->capability & (uint32_t)kSDMMCHOST_SupportDDRMode) != 0U) &&
                ((card->cccrflags & SDIO_CCCR_SUPPORT_DDR50) == SDIO_CCCR_SUPPORT_DDR50) &&
                (card->operationVoltage == kSDMMC_OperationVoltage180V))
            {
                targetTiming    = SDIO_CCCR_ENABLE_DDR50_MODE;
                targetBusFreq   = FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_50MHZ);
                supportModeFlag = SDIO_CCCR_SUPPORT_DDR50;
            }
            else
            {
                card->currentTiming = kSD_TimingSDR50Mode;
            }
        }

        if (card->currentTiming == kSD_TimingSDR50Mode)
        {
            if (((card->host->capability & (uint32_t)kSDMMCHOST_SupportSDR50) != 0U) &&
                ((card->cccrflags & SDIO_CCCR_SUPPORT_SDR50) == SDIO_CCCR_SUPPORT_SDR50) &&
                (card->operationVoltage == kSDMMC_OperationVoltage180V))
            {
                targetTiming    = SDIO_CCCR_ENABLE_SDR50_MODE;
                targetBusFreq   = FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_100MHZ);
                supportModeFlag = SDIO_CCCR_SUPPORT_SDR50;
            }
            else
            {
                card->currentTiming = kSD_TimingSDR25HighSpeedMode;
            }
        }

        if (card->currentTiming == kSD_TimingSDR25HighSpeedMode)
        {
            if ((card->cccrflags & SDIO_CCCR_SUPPORT_HIGHSPEED) == SDIO_CCCR_SUPPORT_HIGHSPEED)
            {
                targetTiming    = SDIO_CCCR_ENABLE_HIGHSPEED_MODE;
                targetBusFreq   = FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, SD_CLOCK_50MHZ);
                supportModeFlag = SDIO_CCCR_SUPPORT_HIGHSPEED;
            }
            else
            {
                card->currentTiming = kSD_TimingSDR12DefaultMode;
            }
        }

        if (card->currentTiming == kSD_TimingSDR12DefaultMode)
        {
            /* default timing mode */
            targetBusFreq = SD_CLOCK_25MHZ;
        }

        error = SDIO_IO_Access_Direct(card, kSDIO_IORead, kSDIO_FunctionNum0, kSDIO_RegBusSpeed, 0U, &temp, false);
        if (kStatus_Success != error)
        {
            return kStatus_SDMMC_TransferFailed;
        }
        do
        {
            temp &= (uint8_t)~SDIO_CCCR_BUS_SPEED_MASK;
            temp |= (uint8_t)targetTiming;

            retryTimes--;
            error =
                SDIO_IO_Access_Direct(card, kSDIO_IOWrite, kSDIO_FunctionNum0, kSDIO_RegBusSpeed, temp, &temp, true);
            if (kStatus_Success != error)
            {
                continue;
            }

            if ((temp & targetTiming) != targetTiming)
            {
                continue;
            }

            break;

        } while (retryTimes != 0U);

        if (retryTimes == 0U)
        {
            retryTimes = SDIO_RETRY_TIMES;
            /* if cannot switch target timing, it will switch continuously until find a valid timing. */
            card->cccrflags &= ~supportModeFlag;
            continue;
        }

        break;

    } while (true);

    card->busClock_Hz =
        SDMMCHOST_SetCardClock(card->host, FSL_SDMMC_CARD_MAX_BUS_FREQ(card->usrParam.maxFreq, targetBusFreq));

    /* enable DDR mode if it is the target mode */
    if (card->currentTiming == kSD_TimingDDR50Mode)
    {
        SDMMCHOST_EnableDDRMode(card->host, true, 0U);
    }

    if (card->usrParam.ioStrength != NULL)
    {
        card->usrParam.ioStrength(card->busClock_Hz);
    }

    /* SDR50 and SDR104 mode need tuning */
    if ((card->currentTiming == kSD_TimingSDR50Mode) || (card->currentTiming == kSD_TimingSDR104Mode))
    {
        /* execute tuning */
        if (SDIO_ExecuteTuning(card) != kStatus_Success)
        {
            return kStatus_SDMMC_TuningFail;
        }
    }

    return kStatus_Success;
}

