nxp-appcodehub/dm-wifi-cli-frdm-mcxn947/sdmmc/src/fsl_sdio.c
    /* get card capability */
    if (kStatus_Success != SDIO_GetCardCapability(card, kSDIO_FunctionNum0))
    {
        return kStatus_SDMMC_TransferFailed;
    }

    /* read common CIS here */
    if (SDIO_ReadCIS(card, kSDIO_FunctionNum0, s_tupleList, SDIO_COMMON_CIS_TUPLE_NUM) != kStatus_Success)
    {
        return kStatus_SDMMC_SDIO_ReadCISFail;
    }

    /* switch data bus width */
    if (kStatus_Success != SDIO_SetMaxDataBusWidth(card))
    {
        return kStatus_SDMMC_SetDataBusWidthFailed;
    }

    /* trying switch to card support timing mode. */
    if (kStatus_Success != SDIO_SelectBusTiming(card))
    {
        return kStatus_SDMMC_SDIO_SwitchHighSpeedFail;
    }

    return kStatus_Success;
}

status_t SDIO_CardInit(sdio_card_t *card)
{
    assert(card != NULL);

    status_t error = kStatus_Success;
    /* create mutex lock */
    (void)SDMMC_OSAMutexCreate(&card->lock);
    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);

    SDIO_SetCardPower(card, true);

    error = sdiocard_init(card);

    (void)SDMMC_OSAMutexUnlock(&card->lock);

    return error;
}

void SDIO_CardDeinit(sdio_card_t *card)
{
    assert(card != NULL);

    (void)SDMMC_OSAMutexLock(&card->lock, osaWaitForever_c);
    (void)SDIO_CardReset(card);
    (void)SDIO_SelectCard(card, false);
    SDIO_SetCardPower(card, false);
    (void)SDMMC_OSAMutexDestroy(&card->lock);
}

status_t SDIO_HostInit(sdio_card_t *card)
{
    assert(card != NULL);

    if (!card->isHostReady)
    {
        if (SDMMCHOST_Init(card->host) != kStatus_Success)
        {
            return kStatus_Fail;
        }
    }

    if ((card->usrParam.cd->type == kSD_DetectCardByHostCD) || (card->usrParam.cd->type == kSD_DetectCardByHostDATA3))
    {
        (void)SDMMCHOST_CardDetectInit(card->host, card->usrParam.cd);
    }

    if (card->usrParam.sdioInt != NULL)
    {
        (void)SDMMCHOST_CardIntInit(card->host, card->usrParam.sdioInt);
    }

    /* set the host status flag, after the card re-plug in, don't need init host again */
    card->isHostReady = true;

    return kStatus_Success;
}

void SDIO_HostDeinit(sdio_card_t *card)
{
    assert(card != NULL);

    SDMMCHOST_Deinit(card->host);

    /* should re-init host */
    card->isHostReady = false;
}

void SDIO_HostDoReset(sdio_card_t *card)
{
    SDMMCHOST_Reset(card->host);
}

status_t SDIO_PollingCardInsert(sdio_card_t *card, uint32_t status)
{
    assert(card != NULL);
    assert(card->usrParam.cd != NULL);

    if (card->usrParam.cd->type == kSD_DetectCardByGpioCD)
    {
        if (card->usrParam.cd->cardDetected == NULL)
        {
            return kStatus_Fail;
        }

        do
        {
            if ((card->usrParam.cd->cardDetected() == true) && (status == (uint32_t)kSD_Inserted))
            {
                SDMMC_OSADelay(card->usrParam.cd->cdDebounce_ms);
                if (card->usrParam.cd->cardDetected() == true)
                {
                    break;
                }
            }

            if ((card->usrParam.cd->cardDetected() == false) && (status == (uint32_t)kSD_Removed))
            {
                break;
            }
        } while (true);
    }
    else
    {
        if (card->isHostReady == false)
        {
            return kStatus_Fail;
        }

        if (SDMMCHOST_PollingCardDetectStatus(card->host, status, ~0U) != kStatus_Success)
        {
            return kStatus_Fail;
        }
    }

    return kStatus_Success;
}

bool SDIO_IsCardPresent(sdio_card_t *card)
{
    assert(card != NULL);
    assert(card->usrParam.cd != NULL);

    if (card->usrParam.cd->type == kSD_DetectCardByGpioCD)
    {
        if (card->usrParam.cd->cardDetected == NULL)
        {
            return false;
        }
        return card->usrParam.cd->cardDetected();
    }
    else
    {
        if (card->isHostReady == false)
        {
            return false;
        }

        if (SDMMCHOST_CardDetectStatus(card->host) == (uint32_t)kSD_Removed)
        {
            return false;
        }
    }

    return true;
}

void SDIO_SetCardPower(sdio_card_t *card, bool enable)
{
    assert(card != NULL);

    uint32_t powerDelay = 0U;

    if (card->usrParam.pwr != NULL)
    {
        card->usrParam.pwr(enable);
    }
    else
    {
        SDMMCHOST_SetCardPower(card->host, enable);
    }

    if (enable)
    {
        powerDelay = card->usrParam.powerOnDelayMS == 0U ? SDIO_POWER_ON_DELAY : card->usrParam.powerOnDelayMS;
    }
    else
    {
        powerDelay = card->usrParam.powerOffDelayMS == 0U ? SDIO_POWER_OFF_DELAY : card->usrParam.powerOffDelayMS;
    }

    SDMMC_OSADelay(powerDelay);
}

status_t SDIO_Init(sdio_card_t *card)
{
    assert(card != NULL);
    assert(card->host != NULL);

    status_t error = kStatus_Success;

    if (!card->isHostReady)
    {
        if (SDIO_HostInit(card) != kStatus_Success)
        {
            error = kStatus_SDMMC_HostNotReady;
        }
    }
    else
    {
        /* reset the host */
        SDIO_HostDoReset(card);
    }

    if (error == kStatus_Success)
    {
        /* card detect */
        if (SDIO_PollingCardInsert(card, kSD_Inserted) != kStatus_Success)
        {
            error = kStatus_SDMMC_CardDetectFailed;
        }
        else
        {
            error = SDIO_CardInit(card);
            if (error != kStatus_Success)
            {
                error = kStatus_SDMMC_CardInitFailed;
            }
        }
    }

    return error;
}

void SDIO_Deinit(sdio_card_t *card)
{
    assert(card != NULL);

    SDIO_CardDeinit(card);
    SDIO_HostDeinit(card);
}

status_t SDIO_EnableIOInterrupt(sdio_card_t *card, sdio_func_num_t func, bool enable)
{
    assert(card != NULL);
    assert(func <= kSDIO_FunctionNum7);

    uint8_t intEn  = 0U;
    status_t error = kStatus_Success;

    /* load io interrupt enable register */
    error = SDIO_IO_Access_Direct(card, kSDIO_IORead, kSDIO_FunctionNum0, kSDIO_RegIOIntEnable, 0U, &intEn, false);
    if (kStatus_Success != error)
    {
        return kStatus_SDMMC_TransferFailed;
    }

    if (enable)
    {
        /* if already enable , do not need enable again */
        if ((((intEn >> (uint32_t)func) & 0x01U) == 0x01U) && ((intEn & 0x01U) != 0U))
        {
            return kStatus_Success;
        }

